ShallowGreen123/T5_P4_Epaper/examples/hdmi_video_renderer_lvgl/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 6.0.1 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32p4"
# IDF 6.0.1 represents ESP32-P4 v3.2 with the v3.1-v3.99 range.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=n
CONFIG_ESP32P4_REV_MIN_301=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_SPIRAM_MEMTEST=n
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FREERTOS_HZ=1000
CONFIG_BSP_LCD_DPI_BUFFER_NUMS=2
CONFIG_BSP_LCD_COLOR_FORMAT_RGB888=y
CONFIG_BSP_LCD_TYPE_HDMI=y
CONFIG_BSP_LCD_HDMI_800x600_60HZ=y
CONFIG_BSP_LCD_LT8912B_TEST_PATTERN=n
CONFIG_BSP_LCD_LT8912B_MIPI_AUTO_DETECT=y
CONFIG_LV_CONF_SKIP=y
CONFIG_LV_COLOR_DEPTH_32=y
CONFIG_LV_COLOR_DEPTH=32
CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_BUILD_EXAMPLES=n
CONFIG_LV_USE_DEMO_BENCHMARK=y
CONFIG_HDMI_LVGL_DEMO_BENCHMARK=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
